start_msg = 'Здравствуйте {}, тут вы сможете на заказ приобрести телеграм бота'
admin_text = ('Здрайвствуйте администратор  {}, \n'
              'Тут вы можете узнать статистику или же отправить рассылку всем пользователям\n'
              'Воспользуйтесь кнопками ниже\n'
              '| | |\n'
              '| | |\n'
              '+ + +')
bot_info_text = ('В этом боте вы можете заказать бота для телеграм на базе aiogram 3\n'
                 '<b>Мы предоставляем:</b>\n\n'
                 '1. Удобную и понятную структуру которую поймут другие программисты\n'
                 '2. Комментирование кода(так же для читаемости кода)\n'
                 '3. Полная настройка и подключения бота к серверу(бесплатно)\n'
                 '4. Работу бота на вебхуках(можете почитать в интернете что это)\n'
                 '5. Доступные цены и быстрое выполнение заказов\n'
                 '6. Бесплатную консультанцию по любому вопросу связанному с нашими услугами')
buy_bot_text = ('Для приобретения бота вы можете обратиться ко мне в личные сообщение\n\n'
                '<b>Кнопка ниже</b>\n\n'
                'Там мы более подробно обсудим тз и цену а так же сроки выполнения работы')
mailing_text = ('Перешлите сообщение или напишите сами можно добавить фото\n'
                'Кнопки  добавить в дальнейшем нельзя')
mailing_accept = ("Предпросмотр сообщения выше:\n"
                  "Вы уверены что хотите разослать это сообщение всем пользователям бота?\n")
statistic_text = ("<b>Статистика:</b>\n\n"
                  "Всего пользователей: {}\n"
                  "Забанили бота: {}\n"
                  "Подписчиков: {}\n\n"
                  "Количество забаненных обновляется после рассылки")
price_text = ("<b>Наш прайс лист:</b>\n"
              "На самом деле нет фиксированной цены\n"
              "Поскольку цена бота зависит от сложности работы и сроков\n"
              "Но мы найдем приемлемое решение под ваш бюджет\n"
              "\n"
              "Будьте готовы что нужны еще деньги на сервер для бота\n"
              "В среднем около 400-600 руб в месяц\n"
              "Так же нужен <b>домен</b> (необязательно, но с ним лучше) цена 180-400 руб на год\n"
              "И <b>SLL сертификат</b> для домена (если все же с доменом) около 3000 руб в год\n"
              "Настройка сервера и домена идет бонусом т.е <b>бесплатная</b>")
mailing_send_accept_text = ('Рассылка отправлено успешно!\n'
                       '\n'
                       'Пользователей получили: {}\n'
                       'Пользователей не получили(забанили бота):{}\n'
                       'Вернуться в главное меню /start')
